Added a Website to see this website in a more structured manner
